Ninagawa123/Meridian_LITE/Meridian_LITE_for_ESP32/src/main.cpp
// Meridian_LITE_v1.0.1_20230820 for Meridan Board -LITE- with ESP32DecKitC
#define VERSION "Hello, This is Meridian_LITE_v1.0.1_20230820." // バージョン表示

// [ 概 要 ] ///////////////////////////////////////////////////////////////////////
// Meridianはサーボやセンサーの状態が格納されたMeridim90というデータ配列を, PCと100Hzで共有します.
// ハードウェアの制限上, サーボ値の返信に若干の取りこぼしがありますが, 取りこぼす直前のデータを使うなど
// の処理で擬似的に安定させています.
// ICSサーボの返信データはサーボ由来の揺らぎがあるため現状では参考値と考えるのがよく,サーボ値を指示して
// 動作させることが基本的な利用法となります.
// Meridian_LITE は, ESP32DevkitC + Meridian board -LITE- の組み合わせで使用します.

// [ 利 用 プ ラ ッ ト フ ォ ー ム ] //////////////////////////////////////////////////
//  ESP32 DevkitC + PlatformIOで使うことを想定
//  PlatformIO上でのESP32のボードバージョンは3.5.0が良い.（4系はうまく動かないらしい）
//  Serial1を使うには設定を変更する必要あり. 参考 → https://qiita.com/Ninagawa_Izumi/items/8ce2d55728fd5973087d

// [ デ フ ォ ル ト の ハ ー ド ウ ェ ア ] /////////////////////////////////////////////
// 100Hz通信で安定動作します.
// デフォルトの環境設定は
// ① Meridian Board -LITE- に Espressif ESP32DevKitCを搭載.
// ② ICSサーボL,R 11個ずつ合計22軸分を接続
// ③ リモコン KRC-5FH + KRR-5FH
// ④ 9軸センサ BNO005を搭載
// ⑤ SDカード(SPIに接続)は不搭載
//
// 上記を搭載している場合,
// サーボについてはconfig.h内にて下記の初期設定をしておいてください.
// IDL_MT0 - IDR_MT14     : 各サーボのマウントありなし(デフォルトはKHR - 3HVの22軸設定.)
// IDL_CW0 - IDR_CW14     : 各サーボの回転方向の正負補正
// IDL_TRIM0 - IDR_TRIM14 : 直立時の各サーボのデフォルト値
// その他については,config.h内の SD_MOUNT,MOUNT_IMUAHRS,MOUNT_JOYPAD などをそれぞれ設定します.

// [ WIFI設定 ] ////////////////////////////////////////////////////////////////////
// サーボについてはkeys.h内の /* Wifiアクセスポイントの設定 */ にて
// WIFI_AP_SSID, WIFI_AP_PASS, WIFI_SEND_IP を設定してください.
// PCのIPアドレスはPC側で調べてください.
// ESP32側のIPアドレス, BluetoothMACアドレスはEPS32の起動時にシリアルモニタに表示されます.

// [ バージョン情報 ] ////////////////////////////////////////////////////////////////
// v1.0.1 (20230820)
// ・公式ライブラリの<Meridian.h>に対応しました.
// ・wiimote(wiiリモコン)にデフォルト対応しました.
// ・bno055のヨー軸データが原点リセットに対応し、-180〜180度を取得できるようにしました.
// ・サーボの断線検出に対応しました.
// ・SSIDなどのパスワードを含むヘッダファイルをkeys.hに隔離しました.

//================================================================================================================
//---- 初 期 設 定  -----------------------------------------------------------------------------------------------
//================================================================================================================

/* コンフィグファイルの読み込み */
#include "config.h"
#include "keys.h"

/* ヘッダファイルの読み込み */
#include "main.h"

/* ライブラリ導入 */
#include <Arduino.h>
#include <Meridian.h>           // Meridianのライブラリ導入
MERIDIANFLOW::Meridian mrd;     // ライブラリのクラスを mrdという名前でインスタンス化
#include <WiFi.h>               // WiFi通信用ライブラリ
#include <WiFiUdp.h>            // UDP通信用ライブラリ
WiFiUDP udp;                    // wifi設定
#include <IcsHardSerialClass.h> // KONDOサーボのライブラリ
#include <Wire.h>               // I2C通信用ライブラリ
#include <Adafruit_BNO055.h>    // 9軸センサBNO055用のライブラリ
#include <ESP32Wiimote.h>       // Wiiコントローラーのライブラリ
ESP32Wiimote wiimote;           // Wiiコントローラー設定
#include <SPI.h>                // SPIのライブラリ
#include <SD.h>                 // SDカード用のライブラリ

/* ICSサーボのインスタンス設定 */
IcsHardSerialClass krs_L(&Serial1, PIN_EN_L, ICS_BAUDRATE, ICS_TIMEOUT); // サーボL系統UARTの設定（TX27,RX32,EN33）
IcsHardSerialClass krs_R(&Serial2, PIN_EN_R, ICS_BAUDRATE, ICS_TIMEOUT); // サーボR系統UARTの設定（TX17,RX16,EN4）

/* Meridim配列設定 */
const int MSG_BUFF = MSG_SIZE * 2;     // Meridim配列のバイト長
const int MSG_ERR = MSG_SIZE - 2;      // エラーフラグの格納場所（配列の末尾から2つめ）
const int MSG_ERR_u = MSG_ERR * 2 + 1; // エラーフラグの格納場所（上位8ビット）
const int MSG_ERR_l = MSG_ERR * 2;     // エラーフラグの格納場所（下位8ビット）
const int MSG_CKSM = MSG_SIZE - 1;     // チェックサムの格納場所（配列の末尾）

/* Meridim配列用の共用体の設定 */
typedef union // Meridim配列用の共用体の設定
{
  short sval[MSG_SIZE + 4];           // short型でデフォルト90個の配列データを持つ
  unsigned short usval[MSG_SIZE + 2]; // 上記のunsigned short型
  uint8_t bval[MSG_BUFF + 4];         // 1バイト単位でデフォルト180個の配列データを持つ
} UnionData;
UnionData s_udp_meridim = {0}; // UDP送信用共用体のインスタンスを宣言
UnionData r_udp_meridim = {0}; // UDP受信用共用体のインスタンスを宣言

/* システム用変数 */
TaskHandle_t thp[4];                                           // マルチスレッドのタスクハンドル格納用
File myFile;                                                   // SDカード用
int servo_num_max = max(MOUNT_SERVO_NUM_L, MOUNT_SERVO_NUM_R); // サーボ送受信のループ処理数（L系R系で多い方）

/* フラグ関連変数 */
bool udp_rsvd_flag = 0; // UDPの受信終了フラグ

/* タイマー管理用の変数 */
long frame_ms = FRAME_DURATION;  // 1フレームあたりの単位時間(ms)
long mrd_t_mil = (long)millis(); // フレーム管理時計の時刻 Meridian Time.
long now_t_mil = (long)millis(); // 現在時刻をミリ秒で取得
long now_t_mic = (long)micros(); // 現在時刻をマイクロ秒で取得
int frame_count = 0;             // サイン計算用の変数
int frame_count_diff = 2;        // サインカーブ動作などのフレームカウントをいくつずつ進めるか
int frame_count_max = 360000;    // フレームカウントの最大値
int joypad_polling_count = 0;    // JOYPADのデータを読みに行くためのフレームカウント
int mrd_seq_s_increment = 0;     // フレーム毎に0-59999をカウントし、送信
int mrd_seq_r_expect = 0;        // フレーム毎に0-59999をカウントし、受信値と比較

/* エラーカウント用 */
int err_pc_esp = 0; // ESP32の受信エラー（PCからのUDP）

/* 各種モード設定 */
//

/* リモコン用変数 */
typedef union
{
  short sval[4];       // short型で4個の配列データを持つ
  uint16_t usval[4];   // 上記のunsigned short型
  int8_t bval[8];      // 上記のbyte型
  uint8_t ubval[8];    // 上記のunsigned byte型
  uint64_t ui64val[1]; // 上記のunsigned int16型
                       // button, pad_stick_L_x:pad_stick_L_y,
                       // pad_stick_R_x:pad_stick_R_y, pad_L2_val:pad_R2_val
} UnionPad;
UnionPad pad_array = {0}; // リモコン値格納用の配列
unsigned short pad_btn = 0;
int pad_stick_R = 0;
int pad_stick_R_x = 0;
int pad_stick_R_y = 0;
int pad_stick_L = 0;
int pad_stick_L_x = 0;
int pad_stick_L_y = 0;
int pad_stick_V = 0;
int pad_R2_val = 0;
int pad_L2_val = 0;

/* センサー(BNO055)用の変数*/
Adafruit_BNO055 bno = Adafruit_BNO055(55, 0x28, &Wire);
float bno055_read[16];        // bno055のデータの一時保存
float imuahrs_yaw_origin = 0; // ヨー軸の原点セット用

/* 各サーボのマウントありなし */
int idl_mount[15] = {IDL_MT0, IDL_MT1, IDL_MT2, IDL_MT3, IDL_MT4, IDL_MT5, IDL_MT6, IDL_MT7, IDL_MT8, IDL_MT9, IDL_MT10, IDL_MT11, IDL_MT12, IDL_MT13, IDL_MT14}; // L系統
int idr_mount[15] = {IDR_MT0, IDR_MT1, IDR_MT2, IDR_MT3, IDR_MT4, IDR_MT5, IDR_MT6, IDR_MT7, IDR_MT8, IDR_MT9, IDR_MT10, IDR_MT11, IDR_MT12, IDR_MT13, IDR_MT14}; // R系統
int id3_mount[15] = {0};                                                                                                                                          // 3系統

