Ninagawa123/Meridian_LITE/Meridian_LITE_for_ESP32/src/main.cpp
/* 各サーボの正逆方向補正用配列 */
int idl_cw[15] = {IDL_CW0, IDL_CW1, IDL_CW2, IDL_CW3, IDL_CW4, IDL_CW5, IDL_CW6, IDL_CW7, IDL_CW8, IDL_CW9, IDL_CW10, IDL_CW11, IDL_CW12, IDL_CW13, IDL_CW14}; // L系統
int idr_cw[15] = {IDR_CW0, IDR_CW1, IDR_CW2, IDR_CW3, IDR_CW4, IDR_CW5, IDR_CW6, IDR_CW7, IDR_CW8, IDR_CW9, IDR_CW10, IDR_CW11, IDR_CW12, IDR_CW13, IDR_CW14}; // R系統

/* 各サーボの直立ポーズトリム値(degree) */
float idl_trim[15] = {IDL_TRIM0, IDL_TRIM1, IDL_TRIM2, IDL_TRIM3, IDL_TRIM4, IDL_TRIM5, IDL_TRIM6, IDL_TRIM7, IDL_TRIM8, IDL_TRIM9, IDL_TRIM10, IDL_TRIM11, IDL_TRIM12, IDL_TRIM13, IDL_TRIM14}; // L系統
float idr_trim[15] = {IDR_TRIM0, IDR_TRIM1, IDR_TRIM2, IDR_TRIM3, IDR_TRIM4, IDR_TRIM5, IDR_TRIM6, IDR_TRIM7, IDR_TRIM8, IDR_TRIM9, IDR_TRIM10, IDR_TRIM11, IDR_TRIM12, IDR_TRIM13, IDR_TRIM14}; // R系統

/* サーボのポジション用配列 */
int s_servo_pos_L[15] = {0}; // 15要素 100倍したdegree値
int s_servo_pos_R[15] = {0}; // 15要素 100倍したdegree値

/* 各サーボのポジション値(degree) */
float idl_tgt[15] = {0};      // L系統の目標値
float idr_tgt[15] = {0};      // R系統の目標値
float idl_tgt_past[15] = {0}; // L系統の前回の値
float idr_tgt_past[15] = {0}; // R系統の前回の値

/* サーボのエラーカウンタ配列 */
int idl_err[15] = {0}; // 15要素
int idr_err[15] = {0}; // 15要素

/* 計算用変数 */
float n; // 計算用
int k;   // 各サーボの計算用変数

//================================================================================================================
//---- S E T  U P -----------------------------------------------------------------------------------------------
//================================================================================================================
void setup()
{
  /* ピンモードの設定 */
  pinMode(ERR_LED, OUTPUT); // エラー通知用LED

  /* PC用シリアルの設定 */
  Serial.begin(SERIAL_PC_BPS);

  /* サーボモーター用シリアルの設定 */
  krs_L.begin();
  krs_R.begin();
  delay(200);

  /* 起動メッセージ1 */
  mrd.print_esp_hello_start(VERSION, String(SERIAL_PC_BPS), WIFI_AP_SSID);

  /* WiFiの初期化と開始 */
  init_wifi(WIFI_AP_SSID, WIFI_AP_PASS);
  while (WiFi.status() != WL_CONNECTED)
  {           // https://www.arduino.cc/en/Reference/WiFiStatus 戻り値一覧
    delay(1); // 接続が完了するまでループで待つ
  }

  /* 起動メッセージ2 */
  mrd.print_esp_hello_ip(WIFI_SEND_IP, WiFi.localIP().toString(), FIXED_IP_ADDR, MODE_FIXED_IP);

  /* UDP通信の開始 */
  udp.begin(UDP_RESV_PORT);

  /* Bluetoothリモコン関連の処理 */
  bt_settings();

  /* I2Cの開始 */
  Wire.begin(22, 21);

  /* センサの初期化 */
  init_imuahrs(MOUNT_IMUAHRS);

  /* スレッドの開始 */
  if (MOUNT_IMUAHRS == 3)
  {
    xTaskCreatePinnedToCore(Core1_bno055_r, "Core1_bno055_r", 4096, NULL, 10, &thp[0], 1);
    Serial.println("Core1 thread for bno055 start.");
    delay(10); // センサー用スレッド
  }

  /* SDカードの初期設定とチェック */
  check_sd();

  /* マウントされたサーボIDの表示 */
  mrd.print_servo_mounts(idl_mount, idr_mount, id3_mount);

  /* JOYPADの認識 */
  mrd.print_controlpad(MOUNT_JOYPAD, JOYPAD_POLLING);

  /* Bluetoothの初期化 */
  uint8_t bt_mac[6];
  String self_mac_address = "";
  esp_read_mac(bt_mac, ESP_MAC_BT); // ESP32自身のBluetoothMacアドレスを表示
  self_mac_address = String(bt_mac[0], HEX) + ":" + String(bt_mac[1], HEX) + ":" + String(bt_mac[2], HEX) + ":" + String(bt_mac[3], HEX) + ":" + String(bt_mac[4], HEX) + ":" + String(bt_mac[5], HEX);
  Serial.print("ESP32's Bluetooth Mac Address is => " + self_mac_address);
  Serial.println();
  delay(1000);

  /* タイマーの調整と開始のシリアル表示 */
  mrd_t_mil += (long)millis() + 10;                                   // 周期管理用のMeridianTimeをリセット
  Serial.println("-) Meridian -LITE- system on ESP32 now flows. (-"); //

  /* UDP開始用のダミーデータの生成 */
  if (UDP_SEND) // 設定でUDPの送信を行うかどうか決定
  {
    s_udp_meridim.sval[MSG_CKSM] = mrd.cksm_val(s_udp_meridim.sval, MSG_SIZE);
    sendUDP();
    mrd.monitor_check_flow("[start]", MONITOR_FLOW);
  }
}

//================================================================================================================
//---- M A I N  L O O P -----------------------------------------------------------------------------------------
//================================================================================================================
void loop()
{

  //////// < 1 > U D P 受 信 ///////////////////////////////////////////////////////
  // @ [1-1] UDP受信の実行 もしデータパケットが来ていれば受信する
  if (UDP_RESEIVE) // UDPの受信を行うかどうか
  {
    receiveUDP(); // UDPを受信
    if (udp_rsvd_flag)
    {
      mrd.monitor_check_flow("[Rsvd]", MONITOR_FLOW); // デバグ用フロー表示
      udp_rsvd_flag = 0;
    }
  }
  // 　→ ここでr_udp_meridim.sval に受信したMeridim配列が入っている状態。

  // @ [1-2] チェックサムを確認
  if (mrd.cksm_rslt(r_udp_meridim.sval, MSG_SIZE)) // Check sum OK!
  {
    mrd.monitor_check_flow("[CSok]", MONITOR_FLOW); // デバグ用フロー表示

    // @ [1-3] UDP受信配列から UDP送信配列にデータを転写
    memcpy(s_udp_meridim.bval, r_udp_meridim.bval, MSG_SIZE * 2);

    // @ [1-4] エラーフラグ14番(ESP32のPCからのUDP受信エラー検出)をオフ
    s_udp_meridim.bval[MSG_ERR_u] &= B10111111;

    //
    mrd.monitor_check_flow("[1]", MONITOR_FLOW); // デバグ用フロー表示

    //////// < 2 > リ モ コ ン 受 信 ///////////////////////////////////////////////////
    // @ [2-1] コントロールパッド受信値の転記
    if (MOUNT_JOYPAD != 0)
    {
      pad_array.ui64val[0] = joypad_read(MOUNT_JOYPAD, pad_array.ui64val[0], JOYPAD_POLLING, JOYPAD_REFRESH);
      s_udp_meridim.usval[MRD_CONTROL_BUTTONS] = pad_array.usval[0];
      if (MONITOR_JOYPAD)
      {
        monitor_joypad(pad_array.usval);
      }
      //
      mrd.monitor_check_flow("[2]", MONITOR_FLOW); // デバグ用フロー表示
    }

    //////// < 3 > 受 信 コ マ ン ド に 基 づ く 制 御 処 理 /////////////////////////////
    // @[3-1] マスターコマンドの判定により工程の実行orスキップを分岐
    execute_MasterCommand(); // マスターコマンドの実行

    //
    mrd.monitor_check_flow("[3]", MONITOR_FLOW); // デバグ用フロー表示

    //////// < 4 > E S P 内 部 で 位 置 制 御 す る 場 合 の 処 理 ///////////////////////
    // @[4-1] 現在はとくに設定なし

    //
    mrd.monitor_check_flow("[4]", MONITOR_FLOW); // デバグ用フロー表示

    //////// < 5 > サ ー ボ 動 作 の 実 行 /////////////////////////////////////////////
    // @ [5-1] UDPから受信したサーボ位置をサーボ配列に書き込む
    for (int i = 0; i < servo_num_max; i++)
    {
      idl_tgt_past[i] = idl_tgt[i];                       // 前回のdegreeをキープ
      idr_tgt_past[i] = idr_tgt[i];                       // 前回のdegreeをキープ
      idl_tgt[i] = s_udp_meridim.sval[i * 2 + 21] * 0.01; // 受信したdegreeを格納
      idr_tgt[i] = s_udp_meridim.sval[i * 2 + 51] * 0.01; // 受信したdegreeを格納
    }

    // @ [5-2] サーボ受信値の処理
    if (s_udp_meridim.sval[MRD_MASTER] != 0)
    {
      for (int i = 0; i < servo_num_max; i++) // ICS_L系統の処理
      {                                       // 接続したサーボの数だけ繰り返す。最大は15
        if (idl_mount[i])
        {
          if (s_udp_meridim.sval[(i * 2) + 20] == 1) // 受信配列のサーボコマンドが1ならPos指定
          {
            k = krs_L.setPos(i, mrd.Deg2Krs(idl_tgt[i], idl_trim[i], idl_cw[i]));
            if (k == -1) // サーボからの返信信号を受け取れなかった時は前回の数値のままにする
            {
              k = mrd.Deg2Krs(idl_tgt_past[i], idl_trim[i], idl_cw[i]);
              idl_err[i]++;
              if (idl_err[i] >= SERVO_LOST_ERROR_WAIT)
              {
                s_udp_meridim.bval[MSG_ERR_l] = char(i); // Meridim[MSG_ERR] エラーを出したサーボID（0をID[L00]として[L99]まで）
                mrd.monitor_servo_error("L", i, MONITOR_SERVO_ERR);
              }
            }
            else
            {
              idl_err[i] = 0;
            }
          }
          else // 1以外ならとりあえずサーボを脱力し位置を取得。手持ちの最大は15
          {
            k = krs_L.setFree(i); // サーボからの返信信号を受け取れていれば値を更新
            if (k == -1)          // サーボからの返信信号を受け取れなかった時は前回の数値のままにする
            {
              k = mrd.Deg2Krs(idl_tgt_past[i], idl_trim[i], idl_cw[i]);
              idl_err[i]++;
              if (idl_err[i] >= SERVO_LOST_ERROR_WAIT)
              {
                s_udp_meridim.bval[MSG_ERR_l] = char(i); // Meridim[MSG_ERR] エラーを出したサーボID（0をID[L00]として[L99]まで）
                mrd.monitor_servo_error("L", i, MONITOR_SERVO_ERR);
              }
            }
            else
            {
              idl_err[i] = 0;
            }
          }
          idl_tgt[i] = mrd.Krs2Deg(k, idl_trim[i], idl_cw[i]);
        }
        delayMicroseconds(1);

        if (idr_mount[i])
        {
          if (s_udp_meridim.sval[(i * 2) + 50] == 1) // 受信配列のサーボコマンドが1ならPos指定
          {
            k = krs_R.setPos(i, mrd.Deg2Krs(idr_tgt[i], idr_trim[i], idr_cw[i]));
            if (k == -1) // サーボからの返信信号を受け取れなかった時は前回の数値のままにする
            {
              k = mrd.Deg2Krs(idr_tgt_past[i], idr_trim[i], idr_cw[i]);
              idr_err[i]++;
              if (idr_err[i] >= SERVO_LOST_ERROR_WAIT)
              {
                s_udp_meridim.bval[MSG_ERR_l] = char(i + 100); // Meridim[MSG_ERR] エラーを出したサーボID（100をID[R00]として[R99]まで）
                mrd.monitor_servo_error("R", i + 100, MONITOR_SERVO_ERR);
              }
            }
            else
            {
              idr_err[i] = 0;
            }
          }
          else // 1以外ならとりあえずサーボを脱力し位置を取得
          {
            k = krs_R.setFree(i);
            if (k == -1) // サーボからの返信信号を受け取れなかった時は前回の数値のままにする
            {
              k = mrd.Deg2Krs(idr_tgt_past[i], idr_trim[i], idr_cw[i]);
              idr_err[i]++;
              if (idr_err[i] >= SERVO_LOST_ERROR_WAIT)
              {
                s_udp_meridim.bval[MSG_ERR_l] = char(i + 100); // Meridim[MSG_ERR] エラーを出したサーボID（100をID[R00]として[R99]まで）
                mrd.monitor_servo_error("R", i + 100, MONITOR_SERVO_ERR);
              }
            }
            else
            {
              idr_err[i] = 0;
            }
          }
          idr_tgt[i] = mrd.Krs2Deg(k, idr_trim[i], idr_cw[i]);
        }
        delayMicroseconds(1);
      }

      //
      mrd.monitor_check_flow("[5]", MONITOR_FLOW); // デバグ用フロー表示
    }
  }
  else // Check sum NG
  {
    err_pc_esp++;
    s_udp_meridim.bval[MSG_ERR_u] |= B01000000;     // エラーフラグ14番(ESP32のPCからのUDP受信エラー検出)をオン
    mrd.monitor_check_flow("[csNG]", MONITOR_FLOW); // デバグ用フロー表示
  }

  //////// < 6 > サ ー ボ 受 信 値 の 処 理 //////////////////////////////////////////
  // @[6-1] サーボIDごとにの現在位置もしくは計算結果を配列に格納
  for (int i = 0; i < 15; i++)
  {
    // s_udp_meridim.sval[i * 2 + 20] = 0;                              // 仮にここでは各サーボのコマンドを脱力&ポジション指示(0)に設定
    s_udp_meridim.sval[i * 2 + 21] = mrd.float2HfShort(idl_tgt[i]); // 仮にここでは最新のサーボ角度degreeを格納
  }
  for (int i = 0; i < 15; i++)
  {
    // s_udp_meridim.sval[i * 2 + 50] = 0;                              // 仮にここでは各サーボのコマンドを脱力&ポジション指示(0)に設定
    s_udp_meridim.sval[i * 2 + 51] = mrd.float2HfShort(idr_tgt[i]); // 仮にここでは最新のサーボ角度degreeを格納
  }

  //
  mrd.monitor_check_flow("[6]", MONITOR_FLOW); // デバグ用フロー表示

  //////// < 7 > エ ラ ー リ ポ ー ト の 作 成 ///////////////////////////////////////
  // @[7-1] シーケンス番号チェック
  mrd_seq_r_expect = mrd.seq_predict_num(mrd_seq_r_expect);                                // シーケンス番号予想値の生成
  monitor_seq_num(mrd_seq_r_expect, int(s_udp_meridim.usval[MRD_SEQENTIAL]), MONITOR_SEQ); // シーケンス番号の表示

