Ninagawa123/Meridian_LITE/Meridian_LITE_for_ESP32/src/main.cpp
    /*
      // センサフュージョンの方向推定値のクオータニオン
      imu::Quaternion quat = bno.getQuat();
      Serial.print("qW: "); Serial.print(quat.w(), 4);
      Serial.print(" qX: "); Serial.print(quat.x(), 4);
      Serial.print(" qY: "); Serial.print(quat.y(), 4);
      Serial.print(" qZ: "); Serial.println(quat.z(), 4);
    */

    /*
    // キャリブレーションのステータスの取得と表示
    uint8_t system, gyro, accel, mag = 0;
    bno.getCalibration(&system, &gyro, &accel, &mag);
    Serial.print("CALIB Sys:"); Serial.print(system, DEC);
    Serial.print(", Gy"); Serial.print(gyro, DEC);
    Serial.print(", Ac"); Serial.print(accel, DEC);
    Serial.print(", Mg"); Serial.println(mag, DEC);
    */
    delay(IMUAHRS_POLLING);
  }
}

void monitor_joypad(ushort *arr)
{
  for (int i = 0; i < 4; i++)
  {
    Serial.print(arr[i]);
    if (i < 3)
    {
      Serial.print("/");
    }
  }
  Serial.println();
}

void monitor_seq_num(int exp, int rsvd, bool monitor_seq)
{
  if (monitor_seq)
  {
    Serial.print("exp:revd/");
    Serial.print(exp);
    Serial.print(":");
    Serial.println(rsvd);
  }
}

//================================================================================================================
//---- Command processing ----------------------------------------------------------------------------------------
//================================================================================================================

void execute_MasterCommand()
{
  // コマンド[0]: 全サーボ脱力
  if (s_udp_meridim.sval[MRD_MASTER] == 0)
  {
    servo_all_off();
  }

  // コマンド[90]: サーボオンを含む通常動作

  // コマンド[10002]: IMU/AHRSのヨー軸リセット
  if (s_udp_meridim.sval[MRD_MASTER] == MCMD_UPDATE_YAW_CENTER)
  {
    setyawcenter();
  }

  // コマンド[10003]: トリムモード（既存のものは廃止し、検討中）

  // コマンド[10004]: 通信エラーサーボIDのクリア
  if (s_udp_meridim.sval[MRD_MASTER] == MCMD_CLEAR_SERVO_ERROR_ID)
  {
    s_udp_meridim.bval[MSG_ERR_l] = 0;
  }
}

void servo_all_off()
{
  for (int h = 0; h < 5; h++)
  {
    for (int i = 0; i < 15; i++)
    {
      if (idl_mount[i] == 1)
      {
        krs_L.setFree(i);
      }
      if (idr_mount[i] == 1)
      {
        krs_R.setFree(i);
      }
      delayMicroseconds(2);
    }
  }
  delay(100);
  Serial.println("All servos off.");
}

void setyawcenter()
{
  if (MOUNT_IMUAHRS == 1) // MPU6050
  {
    Serial.println("MPU6050 driver is not implemented in this version.");
  }
  else if (MOUNT_IMUAHRS == 3) // BNO055
  {
    imuahrs_yaw_origin = bno055_read[14];
    s_udp_meridim.sval[0] = MSG_SIZE;
  }
}
